# Limpeza e Preparação de Dados

In [1]:
import numpy as np
import pandas as pd

## Manipulando Dados Ausentes

In [2]:
string_data = pd.Series(['abacaxi', 'laranja', np.nan, 'abacate'])
string_data
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [3]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

### Filtrando Dados Ausentes

In [7]:
from numpy import nan as NA
data = pd.Series([1, NA, 3.5, NA, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [8]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [9]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                     [NA, NA, NA], [NA, 6.5, 3.]])
cleaned = data.dropna()
print(data)
cleaned

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

     0    1    2
0  1.0  6.5  3.0

In [10]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [11]:
data[3] = NA
print(data)
print()
res = data.dropna(axis=0, how='all')
print(res)
final = res.dropna(axis=1, how='all')
print()
print(final)

     0    1    2   3
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

     0    1    2   3
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [21]:
df = pd.DataFrame(np.random.randn(7, 3))
print(df)
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
print(df)
print(df.dropna())
df.dropna(thresh=2)

          0         1         2
0 -0.280667  1.761250 -0.427522
1 -0.831343 -0.013939 -2.329025
2  0.026153  0.702493  0.485110
3 -0.528457 -0.431053  0.701925
4  0.966108 -1.384836 -0.510738
5 -0.450384 -0.875391 -0.287184
6 -0.239806  1.073542 -0.052931
          0         1         2
0 -0.280667       NaN       NaN
1 -0.831343       NaN       NaN
2  0.026153       NaN  0.485110
3 -0.528457       NaN  0.701925
4  0.966108 -1.384836 -0.510738
5 -0.450384 -0.875391 -0.287184
6 -0.239806  1.073542 -0.052931
          0         1         2
4  0.966108 -1.384836 -0.510738
5 -0.450384 -0.875391 -0.287184
6 -0.239806  1.073542 -0.052931

          0         1         2
2  0.026153       NaN  0.485110
3 -0.528457       NaN  0.701925
4  0.966108 -1.384836 -0.510738
5 -0.450384 -0.875391 -0.287184
6 -0.239806  1.073542 -0.052931

### Preenchendo Dados Ausentes

In [14]:
df.fillna(0)

          0         1         2
0 -0.593137  0.000000  0.000000
1  1.187413  0.000000  0.000000
2  0.303411  0.000000 -0.957480
3 -1.261870  0.000000  0.297574
4 -1.661361 -0.724051 -0.072337
5 -0.499856  1.290016  0.172434
6 -1.290572 -2.113752 -0.343272

In [23]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0 -0.280667  0.500000  0.000000
1 -0.831343  0.500000  0.000000
2  0.026153  0.500000  0.485110
3 -0.528457  0.500000  0.701925
4  0.966108 -1.384836 -0.510738
5 -0.450384 -0.875391 -0.287184
6 -0.239806  1.073542 -0.052931

In [24]:
df.fillna({1: 0.5, 2: 0}, inplace=True)
df

          0         1         2
0 -0.280667  0.500000  0.000000
1 -0.831343  0.500000  0.000000
2  0.026153  0.500000  0.485110
3 -0.528457  0.500000  0.701925
4  0.966108 -1.384836 -0.510738
5 -0.450384 -0.875391 -0.287184
6 -0.239806  1.073542 -0.052931

In [25]:
df = pd.DataFrame(np.random.randn(6, 3))
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
print(df)
print(df.fillna(method='ffill'))
print(df.fillna(method='ffill', limit=2))

          0         1         2
0  0.208864 -0.726000 -0.412043
1 -1.113106 -1.936059  0.203205
2 -0.215409       NaN -0.526336
3  1.007529       NaN  0.077950
4  1.660468       NaN       NaN
5 -0.451843       NaN       NaN
          0         1         2
0  0.208864 -0.726000 -0.412043
1 -1.113106 -1.936059  0.203205
2 -0.215409 -1.936059 -0.526336
3  1.007529 -1.936059  0.077950
4  1.660468 -1.936059  0.077950
5 -0.451843 -1.936059  0.077950
          0         1         2
0  0.208864 -0.726000 -0.412043
1 -1.113106 -1.936059  0.203205
2 -0.215409 -1.936059 -0.526336
3  1.007529 -1.936059  0.077950
4  1.660468       NaN  0.077950
5 -0.451843       NaN  0.077950

In [46]:
data = pd.Series([1., NA, 3.5, NA, 7])
print(data)
data.fillna(data.mean())

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

## Transformação de Dados

### Removendo Duplicatas

In [26]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [27]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [28]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [29]:
data['v1'] = range(7)
print(data)
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

    k1  k2  v1
0  one   1   0
1  two   1   1

In [30]:
data.drop_duplicates(['k1'], keep='last')

    k1  k2  v1
4  one   3   4
6  two   4   6

### Transformando Dados usando uma Função ou um Mapeamento

In [32]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                              'Pastrami', 'corned beef', 'Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [33]:
meat_to_animal = {
  'bacon': 'pig',
  'pulled pork': 'pig',
  'pastrami': 'cow',
  'corned beef': 'cow',
  'honey ham': 'pig',
  'nova lox': 'salmon'
}

In [37]:
lowercased = data['food'].str.lower()
print(lowercased)
data['animal'] = lowercased.map(meat_to_animal)
data

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [38]:
data['animal'] = data['food'].map(lambda x: meat_to_animal[x.lower()])
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

### Substituindo Valores

In [39]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [40]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [41]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [42]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [43]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

### Renomeando os Índices dos Eixos

In [44]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Paraná', 'Santa Catarina', 'Rio Grande do Sul'],
                    columns=['um', 'dois', 'tres', 'quatro'])
data

                   um  dois  tres  quatro
Paraná              0     1     2       3
Santa Catarina      4     5     6       7
Rio Grande do Sul   8     9    10      11

In [47]:
transform = lambda x: x.upper()
data.index.map(transform)

Index(['PARANÁ', 'SANTA CATARINA', 'RIO GRANDE DO SUL'], dtype='object')

In [48]:
data.index = data.index.map(transform)
data

                   um  dois  tres  quatro
PARANÁ              0     1     2       3
SANTA CATARINA      4     5     6       7
RIO GRANDE DO SUL   8     9    10      11

In [49]:
data.rename(index=str.upper, columns=str.upper)

                   UM  DOIS  TRES  QUATRO
PARANÁ              0     1     2       3
SANTA CATARINA      4     5     6       7
RIO GRANDE DO SUL   8     9    10      11

### Discretização e Compartimentalização (Binning)

In [50]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [52]:
bins = [18, 25, 35, 60, 100]
categs = pd.cut(ages, bins)
categs

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [54]:
print(categs.codes)
print(categs.categories)
pd.value_counts(categs)

[0 0 0 1 0 0 2 1 3 2 2 1]
IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

### Detectando e Filtrando Valores Discrepantes

In [73]:
data = pd.DataFrame(np.random.randn(1000, 4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.028041    -0.030263     0.003923    -0.034567
std       1.029861     1.002927     1.024104     1.049975
min      -3.172319    -3.338022    -3.557318    -3.317872
25%      -0.660747    -0.686697    -0.663926    -0.755694
50%       0.014435    -0.051730     0.024915    -0.055348
75%       0.712691     0.637678     0.697411     0.666005
max       3.580561     3.242184     3.087136     3.422133

In [74]:
col = data[2]
col[np.abs(col) > 3]

202   -3.260068
502   -3.231612
620    3.087136
636   -3.557318
778   -3.356387
Name: 2, dtype: float64

In [75]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
34   0.705219  3.058926  0.658926 -0.194665
129  0.651577  0.536174  0.952885 -3.317872
184 -1.005867 -3.338022 -0.296029 -0.324279
202 -0.044129 -1.396717 -3.260068  2.835119
227 -1.878825 -0.656518 -1.640748  3.293820
401 -0.397649 -0.022730 -1.360551 -3.142690
502 -0.442513 -0.258243 -3.231612 -0.890692
585  1.233376  0.077030  1.158217  3.422133
620  0.669737 -0.159049  3.087136  0.228394
636 -1.053853 -1.508040 -3.557318 -0.345797
778 -0.185566 -0.520310 -3.356387 -0.691771
881  3.580561  0.743438 -0.722105 -0.643932
951 -3.172319  0.931881  1.478875  0.036928
953 -0.111475  3.242184 -0.811746  0.838098

In [76]:
data[np.abs(data) > 3] = np.sign(data) * 3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.027632    -0.030226     0.005241    -0.034822
std       1.027495     1.000924     1.019434     1.046412
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.660747    -0.686697    -0.663926    -0.755694
50%       0.014435    -0.051730     0.024915    -0.055348
75%       0.712691     0.637678     0.697411     0.666005
max       3.000000     3.000000     3.000000     3.000000

In [77]:
np.sign(data).head()

     0    1    2    3
0 -1.0  1.0 -1.0  1.0
1  1.0 -1.0  1.0 -1.0
2 -1.0 -1.0 -1.0  1.0
3 -1.0  1.0 -1.0 -1.0
4 -1.0 -1.0 -1.0 -1.0

### Calculando Variáveis Indicadoras (Dummy)

In [79]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                   'data1': range(6)})
print(df)
pd.get_dummies(df['key'])

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [80]:
dummies = pd.get_dummies(df['key'], prefix='key')
df_with_dummy = df[['data1']].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [106]:
mnames = ['movie_id', 'title', 'genres']
movies = pd.read_csv('movies.csv', sep=':',
                       header=None, names=mnames)
movies[:10]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [107]:
all_genres = []
for x in movies.genres:
    all_genres.extend(x.split('|'))
genres = pd.unique(all_genres)

In [108]:
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [109]:
zero_matrix = np.zeros((len(movies), len(genres)))
dummies = pd.DataFrame(zero_matrix, columns=genres)
dummies

,Animation,Children's,Comedy,Adventure,Fantasy,Romance,Drama,Action,Crime,Thriller,Horror,Sci-Fi,Documentary,War,Musical,Mystery,Film-Noir,Western
0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3878,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3879,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3880,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3881,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3882,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [110]:
gen = movies.genres[0]
print(gen)
print(gen.split('|'))
dummies.columns.get_indexer(gen.split('|'))

Animation|Children's|Comedy
['Animation', "Children's", 'Comedy']

array([0, 1, 2], dtype=int64)

In [111]:
for i, gen in enumerate(movies.genres):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i, indices] = 1

In [117]:
movies_windic = movies.join(dummies.add_prefix('Genre_'))
movies_windic.iloc[1]
#movies_windic.head(5)

movie_id                                        2
title                              Jumanji (1995)
genres               Adventure|Children's|Fantasy
Genre_Animation                               0.0
Genre_Children's                              1.0
Genre_Comedy                                  0.0
Genre_Adventure                               1.0
Genre_Fantasy                                 1.0
Genre_Romance                                 0.0
Genre_Drama                                   0.0
Genre_Action                                  0.0
Genre_Crime                                   0.0
Genre_Thriller                                0.0
Genre_Horror                                  0.0
Genre_Sci-Fi                                  0.0
Genre_Documentary                             0.0
Genre_War                                     0.0
Genre_Musical                                 0.0
Genre_Mystery                                 0.0
Genre_Film-Noir                               0.0
Genre_Western                                 0.0
Name: 1, dtype: object

In [120]:
np.random.seed(0)
values = np.random.rand(10)
print(values)
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]
pd.get_dummies(pd.cut(values, bins))

[0.5488135  0.71518937 0.60276338 0.54488318 0.4236548  0.64589411
 0.43758721 0.891773   0.96366276 0.38344152]

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           1           0           0
1           0           0           0           1           0
2           0           0           0           1           0
3           0           0           1           0           0
4           0           0           1           0           0
5           0           0           0           1           0
6           0           0           1           0           0
7           0           0           0           0           1
8           0           0           0           0           1
9           0           1           0           0           0

### Eliminando Colunas

In [121]:
to_drop = ['genres']
movies.drop(to_drop, inplace=True, axis=1)
movies.head()

   movie_id                               title
0         1                    Toy Story (1995)
1         2                      Jumanji (1995)
2         3             Grumpier Old Men (1995)
3         4            Waiting to Exhale (1995)
4         5  Father of the Bride Part II (1995)

## Manipulação de Strings

### Métodos de Objetos String

In [122]:
val = 'ciência,de,  dados'
val.split(',')

['ciência', 'de', '  dados']

In [129]:
pieces = [x.strip() for x in val.split(',')]
pieces

['ciência', 'de', 'dados']

In [130]:
first, second, third = pieces
first + '::' + second + '::' + third

'ciência::de::dados'

In [131]:
'::'.join(pieces)

'ciência::de::dados'

In [132]:
print('dados' in val)
print(val.index(','))
print(val.find(':'))

True
7
-1

In [133]:
try:
    val.index(':')
except:
    print("':' not found!!!")

':' not found!!!

In [134]:
val.count(',')

2

In [137]:
print(val.replace(',', '::'))
print(val.replace(',', ''))

ciência::de::  dados
ciênciade  dados

### Expressões Regulares

In [138]:
import re
text = "banco    dados\t ciência  \tredes"
re.split('\s+', text)

['banco', 'dados', 'ciência', 'redes']

In [141]:
regex = re.compile('\s+')
regex.split(text)

['banco', 'dados', 'ciência', 'redes']

In [142]:
#obtém uma lista de todos os padrões que correspondem à regex
regex.findall(text)

['    ', '\t ', '  \t']

In [195]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{3}'

# re.IGNORECASE torna o regex case-insensitive
regex = re.compile(pattern, flags=re.IGNORECASE)

In [191]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [192]:
#devolve um objeto para o primeiro endereço de email que consta no texto
print(text)
m = regex.search(text)
print(m)
text[m.start():m.end()]

dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com

<re.Match object; span=(0, 15), match='dave@google.com'>

'dave@google.com'

In [194]:
#retorna null uma vez que match somente fará a correspondência com o padrão (neste caso o e-mail) se o mesmo ocorrer no início do texto
print(regex.match(text))

<re.Match object; span=(0, 15), match='dave@google.com'>

In [196]:
#substitui as ocorrências do padrão por determinado texto
print(regex.sub('REMOVIDO', text))

Dave REMOVIDO
Steve REMOVIDO
Rob REMOVIDO
Ryan REMOVIDO

In [210]:
#Este regex difere do anterior pois aplica parênteses para separar cada um dos padrões encontrados.
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{3})'
regex = re.compile(pattern, flags=re.IGNORECASE)

In [211]:
m = regex.match('wesm@bright.net')
m.groups()

('wesm', 'bright', 'net')

In [212]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [213]:
#os símbolos especiais \1, \2, representam os grupos de padrões identificados 
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

### Funções de Strings Vetorizadas no Pandas

In [214]:
data = {'Dave': 'dave@hotmail.com', 'Steve': 'steve@gmail.com',
        'Rob': 'rob@gmail.com', 'Wes': np.nan}
data = pd.Series(data)
print(data)
data.isnull()

Dave     dave@hotmail.com
Steve     steve@gmail.com
Rob         rob@gmail.com
Wes                   NaN
dtype: object

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [215]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object